#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_cloudwatch_event_rule.aws_lambda_cost will be created
  + resource "aws_cloudwatch_event_rule" "aws_lambda_cost" {
      + arn                 = (known after apply)
      + description         = "Fires every five minutes"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "aws_lambda_cost"
      + schedule_expression = "rate(5 minutes)"
    }

  # module.aws-lambda-cost.aws_cloudwatch_event_target.aws_lambda_cost will be created
  + resource "aws_cloudwatch_event_target" "aws_lambda_cost" {
      + arn       = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
      + id        = (known after apply)
      + rule      = "aws_lambda_cost"
      + target_id = "aws_lambda_cost"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-02-29T09:35:21.795+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "DU658dBnDFI3lnrFlLyPAYRkvM0N+Nup5XjQSuTp1JI=" -> (known after apply)
        source_code_size               = 951
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_POST_URL" = "https://hooks.slack.com/services/XXXXXXXXXXXXXXXXXXXXXXXXXXX"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-cost.aws_lambda_permission.aws_lambda_cost will be created
  + resource "aws_lambda_permission" "aws_lambda_cost" {
      + action        = "lambda:InvokeFunction"
      + function_name = "aws-lambda-cost"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
